cf_billing/InformationRegisters/бестТарифныеКатегорииНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТарифныеКатегорииНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТарифнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестТарифныеКатегорииНП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ТарифнаяКатегорияЮЛ(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса")); 		 		
	КонецЕсли;
				
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТарифнаяКатегорияЮЛ());
	Если ЗначениеЗаполнено(ТаблицаДляПомещения) Тогда
		Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	КонецЕсли;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;

	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 							= ОператорВыбора.Отбор;		
		ДоступныеПараметры 				= "Организация, Район, Договор, ОбъектРасчета, Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
	//ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	//
	//Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
	//	мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
	//	Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
	//		Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
	//		ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
	//	КонецЦикла;		
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТарифнаяКатегорияЮЛ()
	 Возврат "ВЫБРАТЬ
	         |	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория КАК ТарифнаяКатегория
	         |ИЗ
	         |	РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(, ) КАК бестТарифныеКатегорииНПСрезПоследних";
КонецФункции

#КонецОбласти

#КонецЕсли
